$(function () {
    var
        Windowsize,
        SelectPrice,
        SelectPrice,
        Profile,
        configuration,
        TypeOfDoubleGlazedWindows,
        endWindow = 0,
        sum = 0,

     Windowsize= {
        50: "600x600",
        70: "900x600",
        70: "600x900",
        90: "900x1200",
        110: "900x1500",
        130: "1200x1800",
        150: "1200x2100",
    },

        configuration = {
        "600x600": {
            100: "глухое",
            120: "С одной открывающейся створкой",
            130: "С двумя открывающимися створками",
            125: "Балконный блок",
            133: "Французский балконный блок",
            148: "Одностворчатые двери",
            122: "Штульповые двери",
        },

        "900x600": {
            120: "глухое",
            140: "С одной открывающейся створкой",
            150: "С двумя открывающимися створками",
            145: "Балконный блок",
            153: "Французский балконный блок",
            168: "Одностворчатые двери",
            142: "Штульповые двери",
        },
        "600x900": {
            120: "глухое",
            140: "С одной открывающейся створкой",
            150: "С двумя открывающимися створками",
            145: "Балконный блок",
            153: "Французский балконный блок",
            168: "Одностворчатые двери",
            142: "Штульповые двери",
        },
        "900x1200": {
            140: "глухое",
            160: "С одной открывающейся створкой",
            170: "С двумя открывающимися створками",
            165: "Балконный блок",
            173: "Французский балконный блок",
            188: "Одностворчатые двери ",
            162: "Штульповые двери",
        },
        "900x1500": {
            160: "глухое",
            180: "С одной открывающейся створкой",
            190: "С двумя открывающимися створками",
            185: "Балконный блок",
            193: "Французский балконный блок",
            208: "Одностворчатые двери ",
            182: "Штульповые двери",
        },

        "1200x1800": {
            180: "глухое",
            200: "С одной открывающейся створкой",
            210: "С двумя открывающимися створками",
            205: "Балконный блок",
            213: "Французский балконный блок",
            201: "Одностворчатые двери ",
            200: "Штульповые двери",
        },

        "1200x2100": {
            200: "глухое",
            220: "С одной открывающейся створкой",
            230: "С двумя открывающимися створками",
            225: "Балконный блок",
            233: "Французский балконный блок",
            221: "Одностворчатые двери ",
            220: "Штульповые двери",
        },
    },
    Profile = {
        "600x600": {
            70: "Goodwin WHS 72",
            50: "Goodwin WHS 60",
            30: "Goodwin Softline",
            33: "Goodwin Softline-82",
            25: "Goodwin Proline 70",
            101: "Goodwin Euroline Plus",
            100: "Goodwin TOPLINE",
            105: "Goodwin Euroline",
        },

        "900x600": {
            90: "Goodwin WHS 72",
            70: "Goodwin WHS 60",
            50: "Goodwin Softline",
            53: "Goodwin Softline-82",
            45: "Goodwin Proline 70",
            121: "Goodwin Euroline Plus",
            120: "Goodwin TOPLINE",
            125: "Goodwin Euroline",
        },
        "600x900": {
            90: "Goodwin WHS 72",
            70: "Goodwin WHS 60",
            50: "Goodwin Softline",
            53: "Goodwin Softline-82",
            45: "Goodwin Proline 70",
            121: "Goodwin Euroline Plus",
            120: "Goodwin TOPLINE",
            125: "Goodwin Euroline",
        },
        "900x1200": {
            110: "Goodwin WHS 72",
            90: "Goodwin WHS 60",
            70: "Goodwin Softline",
            73: "Goodwin Softline-82",
            65: "Goodwin Proline 70",
            141: "Goodwin Euroline Plus",
            140: "Goodwin TOPLINE",
            45: "Goodwin Euroline",
        },
        "900x1500": {
            130: "Goodwin WHS 72",
            110: "Goodwin WHS 60",
            90: "Goodwin Softline",
            93: "Goodwin Softline-82",
            85: "Goodwin Proline 70",
            161: "Goodwin Euroline Plus",
            160: "Goodwin TOPLINE",
            165: "Goodwin Euroline",
        },

        "1200x1800": {
            150: "Goodwin WHS 72",
            130: "Goodwin WHS 60",
            120: "Goodwin Softline",
            113: "Goodwin Softline-82",
            105: "Goodwin Proline 70",
            181: "Goodwin Euroline Plus",
            180: "Goodwin TOPLINE",
            185: "Goodwin Euroline",
        },

        "1200x2100": {
            170: "Goodwin WHS 72",
            150: "Goodwin WHS 60",
            140: "Goodwin Softline",
            133: "Goodwin Softline-82",
            125: "Goodwin Proline 70",
            201: "Goodwin Euroline Plus",
            200: "Goodwin TOPLINE",
            205: "Goodwin Euroline",


        },
    },
    TypeOfDoubleGlazedWindows = {
        "600x600": {
            50: "Однокамерный",
            70: "Двухкамерный",
            65: "Однокамерный ЭНЕРГО",
            90: "Двухкамерный ЭНЕРГО",
            120: "Мультифункциональный",
            200: "ClimatGuard Solar",
        },

        "900x600": {
            70: "Однокамерный",
            90: "Двухкамерный",
            85: "Однокамерный ЭНЕРГО",
            73: "Двухкамерный ЭНЕРГО",
            65: "Мультифункциональный",
            220: "ClimaGuard Solar",
        },
        "600x900": {
            70: "Однокамерный",
            90: "Двухкамерный",
            85: "Однокамерный ЭНЕРГО",
            73: "Двухкамерный ЭНЕРГО",
            65: "Мультифункциональный",
            220: "ClimaGuard Solar",
        },
        "900x1200": {
            90: "Однокамерный",
            110: "Двухкамерный",
            105: "Однокамерный ЭНЕРГО",
            93: "Двухкамерный ЭНЕРГО",
            85: "Мультифункциональный",
            240: "ClimatGuard Solar",
        },
        "900x1500": {
            110: "Однокамерный",
            130: "Двухкамерный",
            125: "Однокамерный ЭНЕРГО",
            113: "Двухкамерный ЭНЕРГО",
            105: "Мультифункциональный",
            260: "ClimatGuard Solar",
        },
        "1200x1800": {
            130: "Однокамерный",
            150: "Двухкамерный",
            155: "Однокамерный ЭНЕРГО",
            133: "Двухкамерный ЭНЕРГО",
            125: "Мультифункциональный",
            280: "ClimatGuard Solar",
        },
        "1200x2100": {
            150: "Однокамерный",
            170: "Двухкамерный",
            172: "Однокамерный ЭНЕРГО",
            153: "Двухкамерный ЭНЕРГО",
            145: "Мультифункциональный",
            300: "ClimatGuard Solar",
        },
function insertWindowsize(){
       var html = '';
       for(var size in Windowsize){
       for(price in Windowsize[size]){
           html += ' <option data-size>"'+ size +'" data-price="'+ price +'">'+ size +' - ' +WindowSizes[size][price]
               +' ' + price + 'грн. </option> ';



       }
       }
    }


        }

}